PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p16lf1527.inc
;-----Bank8------------------
ANSELF           EQU  H'040C'
ANSELG           EQU  H'040D'
TMR3             EQU  H'0411'
TMR3L            EQU  H'0411'
TMR3H            EQU  H'0412'
T3CON            EQU  H'0413'
T3GCON           EQU  H'0414'
TMR4             EQU  H'0415'
PR4              EQU  H'0416'
T4CON            EQU  H'0417'
TMR5             EQU  H'0418'
TMR5L            EQU  H'0418'
TMR5H            EQU  H'0419'
T5CON            EQU  H'041A'
T5GCON           EQU  H'041B'
TMR6             EQU  H'041C'
PR6              EQU  H'041D'
T6CON            EQU  H'041E'

;-----Bank9------------------
WPUG             EQU  H'048D'
RC2REG           EQU  H'0491'
RCREG2           EQU  H'0491'
TX2REG           EQU  H'0492'
TXREG2           EQU  H'0492'
SP2BRG           EQU  H'0493'
SP2BRGL          EQU  H'0493'
SPBRGL2          EQU  H'0493'
SP2BRGH          EQU  H'0494'
SPBRGH2          EQU  H'0494'
RC2STA           EQU  H'0495'
RCSTA2           EQU  H'0495'
TX2STA           EQU  H'0496'
TXSTA2           EQU  H'0496'
BAUD2CON         EQU  H'0497'
BAUDCON2         EQU  H'0497'

;-----Bank11------------------
TMR8             EQU  H'0595'
PR8              EQU  H'0596'
T8CON            EQU  H'0597'
TMR10            EQU  H'059C'
PR10             EQU  H'059D'
T10CON           EQU  H'059E'

;-----Bank12------------------
CCPR6            EQU  H'0611'
CCPR6L           EQU  H'0611'
CCPR6H           EQU  H'0612'
CCP6CON          EQU  H'0613'
CCPR7            EQU  H'0614'
CCPR7L           EQU  H'0614'
CCPR7H           EQU  H'0615'
CCP7CON          EQU  H'0616'
CCPR8            EQU  H'0617'
CCPR8L           EQU  H'0617'
CCPR8H           EQU  H'0618'
CCP8CON          EQU  H'0619'
CCPR9            EQU  H'061A'
CCPR9L           EQU  H'061A'
CCPR9H           EQU  H'061B'
CCP9CON          EQU  H'061C'
CCPR10           EQU  H'061D'
CCPR10L          EQU  H'061D'
CCPR10H          EQU  H'061E'
CCP10CON         EQU  H'061F'

;-----Bank31------------------
STATUS_SHAD      EQU  H'0FE4'
WREG_SHAD        EQU  H'0FE5'
BSR_SHAD         EQU  H'0FE6'
PCLATH_SHAD      EQU  H'0FE7'
FSR0L_SHAD       EQU  H'0FE8'
FSR0H_SHAD       EQU  H'0FE9'
FSR1L_SHAD       EQU  H'0FEA'
FSR1H_SHAD       EQU  H'0FEB'
STKPTR           EQU  H'0FED'
TOSL             EQU  H'0FEE'
TOSH             EQU  H'0FEF'

;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NOT_PD           EQU  H'0003'
NOT_TO           EQU  H'0004'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'


;----- INTCON Bits -----------------------------------------------------
IOCIF            EQU  H'0000'
INTF             EQU  H'0001'
TMR0IF           EQU  H'0002'
IOCIE            EQU  H'0003'
INTE             EQU  H'0004'
TMR0IE           EQU  H'0005'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'

T0IF             EQU  H'0002'
T0IE             EQU  H'0005'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'
RA6              EQU  H'0006'
RA7              EQU  H'0007'


;----- PORTB Bits -----------------------------------------------------
RB0              EQU  H'0000'
RB1              EQU  H'0001'
RB2              EQU  H'0002'
RB3              EQU  H'0003'
RB4              EQU  H'0004'
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'


;----- PORTD Bits -----------------------------------------------------
RD0              EQU  H'0000'
RD1              EQU  H'0001'
RD2              EQU  H'0002'
RD3              EQU  H'0003'
RD4              EQU  H'0004'
RD5              EQU  H'0005'
RD6              EQU  H'0006'
RD7              EQU  H'0007'


;----- PORTE Bits -----------------------------------------------------
RE0              EQU  H'0000'
RE1              EQU  H'0001'
RE2              EQU  H'0002'
RE3              EQU  H'0003'
RE4              EQU  H'0004'
RE5              EQU  H'0005'
RE6              EQU  H'0006'
RE7              EQU  H'0007'


;----- PIR1 Bits -----------------------------------------------------
TMR1IF           EQU  H'0000'
TMR2IF           EQU  H'0001'
CCP1IF           EQU  H'0002'
SSP1IF           EQU  H'0003'
TX1IF            EQU  H'0004'
RC1IF            EQU  H'0005'
ADIF             EQU  H'0006'
TMR1GIF          EQU  H'0007'

SSPIF            EQU  H'0003'
TXIF             EQU  H'0004'
RCIF             EQU  H'0005'


;----- PIR2 Bits -----------------------------------------------------
CCP2IF           EQU  H'0000'
TMR8IF           EQU  H'0001'
TMR10IF          EQU  H'0002'
BCL1IF           EQU  H'0003'
TMR3GIF          EQU  H'0005'
TMR5GIF          EQU  H'0006'
OSFIF            EQU  H'0007'

BCLIF            EQU  H'0003'


;----- PIR3 Bits -----------------------------------------------------
TMR3IF           EQU  H'0000'
TMR4IF           EQU  H'0001'
TMR5IF           EQU  H'0002'
TMR6IF           EQU  H'0003'
CCP3IF           EQU  H'0004'
CCP4IF           EQU  H'0005'
CCP5IF           EQU  H'0006'
CCP6IF           EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
SSP2IF           EQU  H'0000'
BCL2IF           EQU  H'0001'
CCP7IF           EQU  H'0002'
CCP8IF           EQU  H'0003'
TX2IF            EQU  H'0004'
RC2IF            EQU  H'0005'
CCP9IF           EQU  H'0006'
CCP10IF          EQU  H'0007'


;----- T1CON Bits -----------------------------------------------------
TMR1ON           EQU  H'0000'
NOT_T1SYNC       EQU  H'0002'
SOSCEN           EQU  H'0003'

